Repository: doubleden/RustQuiz
Catalog: RustQuiz/Localization/Localizable.xcstrings
Source language: en
Languages: ru

source: Which traits must types implement to use in assert_eq!?
ru: Какие черты должны реализовать типы, чтобы use in assert_eq!?

source: Which type is designed to handle clones intelligently?
ru: Какой сайт type предназначен для интеллектуальной обработки клонов?

source: Which type is used for recoverable errors?
ru: Какой type используется для for восстанавливаемых ошибок?

source: Which types typically implement Copy?
ru: Какие типы обычно реализуют Copy?

source: While condition is true
ru: Пока состояние true

source: while let executes loop while pattern continues to match the value
ru: while let выполняет loop while шаблон продолжает match значение

source: Who owns encapsulated types in Object-Based APIs?
ru: Кому принадлежат инкапсулированные типы in Object-Based API?

source: Who owns transactional types in Object-Based APIs?
ru: Кому принадлежат транзакционные типы in Object-Based API?

source: Why ?
ru: Почему ?

source: Why are "just references &T" in recursive type inconvenient?
ru: Почему "просто ссылки &amp;T" in рекурсивные type неудобны?

source: Why are "reference cycles" with Rc<T> dangerous?
ru: Почему "эталонные циклы" с Rc<T> опасны?

source: Why are iterators in Rust considered "zero-cost abstraction"?
ru: Почему итераторы in Rust считаются "абстракцией с нулевыми затратами"?

source: Why are lifetimes often not written in methods?
ru: Почему часто не пишут время жизни in методов?

source: Why can &String be coerced to &str?
ru: Почему &amp;String можно принудить к &amp;str?

source: Why can Rc + RefCell lead to leaks?
ru: Почему можно Rc + RefCell привести к утечкам?

source: Why can't MyBox<T> without Deref be dereferenced with *y?
ru: Почему MyBox<T> без Deref не может быть разыменован с помощью *y?

source: Why can't Rc<T> be used between threads?
ru: Почему нельзя Rc<T> можно использовать между потоками?

source: Why can't tests sometimes be run in parallel?
ru: Почему иногда тесты нельзя запускать in параллельно?

source: Why can't you index a string as s[0]?
ru: Почему вы не можете индексировать строку as s[0]?

source: Why choose panic = 'abort' sometimes?
ru: Почему иногда выбирают panic = 'abort'?

source: Why couldn't Vec<String> be stored in mock object (Messenger example) without RefCell?
ru: Почему нельзя Vec&lt;String&gt; хранится in mock-объект (пример Messenger) без RefCell?

source: Why do structs usually use String instead of &str?
ru: Почему структуры do обычно use String вместо &amp;str?

source: Why do you need to use move in a closure for a new thread?
ru: Зачем do вам нужно use move in закрытие for новой темы?

source: Why does join() return Result<T, Box<Any + Send>> (simplified)?
ru: Почему join() return Result&lt;T, Box<Any + Send>&gt; (упрощенный)?

source: Why does output order from threads differ between runs?
ru: Почему порядок вывода данных из потоков отличается в разных запусках?

source: Why does Post use Option<Box<dyn State>>?
ru: Почему пост use Option&ltBox&lt;dyn Государство&gt;&gt;?

source: Why does request_review take self: Box<Self>?
ru: Почему request_review принимает self: Box&lt;Self&gt;?

source: Why does Rust invalidate the old variable after a move?
ru: Почему Rust аннулирует старую переменную после move?

source: Why does Serde need derive macros?
ru: Зачем Serde нужны производные макросы?

source: Why doesn't direct Poly Iso work well for multiple formats?
ru: Почему не работает прямой Poly Iso for нескольких форматов?

source: Why doesn't DraftPost have a content method in alternative implementation?
ru: Почему у DraftPost нет альтернативной реализации метода содержания in?

source: Why doesn't enum List { Cons(i32, List), Nil } compile?
ru: Почему не компилируется enum List { Cons(i32, List), Nil }?

source: Why doesn't Rc<T> have method to always get &mut T?
ru: Почему не Rc<T> есть метод, чтобы всегда получать &amp;mut T?

source: Why doesn't Rust have null?
ru: Почему в Rust нет null?

source: Why doesn't this compile: fn dangle() -> &String { let s = String::from("x"); &s }?
ru: Почему это не компилируется: fn dangle() -&gt; &amp;String { let s = String::from("x"); &amp;s }?

source: Why is a tuple inconvenient for a rectangle?
ru: Почему кортеж неудобен for прямоугольнику?

source: Why is accessing mutable static unsafe?
ru: Почему доступ к мутабельным static unsafe ?

source: Why is an iterator variable usually declared as mut?
ru: Почему переменная итератора обычно объявляется as mut ?

source: Why is area(width, height) inconvenient?
ru: Почему area(width, height) неудобна?

source: Why is calling Rc::clone(&rc) instead of rc.clone() recommended?
ru: Почему рекомендуется вызывать Rc::clone(&amp;rc) вместо rc.clone()?

source: Why is enum IpAddr better than struct IpAddrKind + String?
ru: Почему enum IpAddr лучше, чем struct IpAddrKind + String?

source: Why is format! better than + for strings?
ru: Почему формат! лучше, чем + for?

source: Why is Mutex<T> also considered an implementation of "interior mutability"?
ru: Почему Mutex<T> также считается реализацией "внутренней мутабельности"?

source: Why is newtype pattern needed?
ru: Зачем нужен шаблон newtype?

source: Why is Pin needed in async Rust?
ru: Зачем нужен штырь in async Rust?

source: Why is RefCell<T> not Sync?
ru: Почему RefCell<T> не синхронизируется?

source: Why is RefCell<T> only for single-threaded code?
ru: Почему RefCell<T> только for однопоточный код?

source: Why is returning a usize index from first_word risky?
ru: Почему возвращать индекс usize из first_word рискованно?

source: Why is struct Rectangle better than a tuple?
ru: Почему struct Rectangle лучше, чем tuple?

source: Why is the Builder pattern useful in Rust?
ru: Почему паттерн Builder полезен in Rust?

source: Why is the move keyword often used in closures passed to spawn?
ru: Почему ключевое слово move часто используется в закрытиях in, передаваемых в spawn?

source: Why is the Principle of Least Astonishment important for UX?
ru: Почему принцип наименьшего удивления важен для for UX?

source: Why is the update_average method private?
ru: Почему метод update_average является частным?

source: Why is Type Consolidation useful for FFI?
ru: Почему консолидация типов полезна for FFI?

source: Why is wrapping iterators into FFI difficult?
ru: Почему сложно обернуть итераторы в FFI?

source: Why isn't main async by default?
ru: Почему main не является async по умолчанию?

source: Why isn't String Copy?
ru: Почему не String Copy ?

source: Why make fields of a validating type private?
ru: Зачем делать поля проверяющего type приватными?

source: Why might code using borrows from outer scope without move not compile?
ru: Почему код, использующий заимствования из внешней области видимости без move, может не компилироваться?

source: Why might multiple small crates be less optimized than one large crate?
ru: Почему несколько маленьких ящиков могут быть менее оптимизированы, чем один большой crate?

source: Why should fallible functions return consumed arguments on error?
ru: Почему нестабильные функции должны return потреблять аргументы при ошибке?

source: Why shouldn't you call drop in Drop::drop on same object?
ru: Почему бы вам не вызвать drop in Drop::drop на том же объекте?

source: Why use async move for async blocks?
ru: Почему use async move for async блоки?

source: Why use references &T?
ru: Почему именно use?

source: why?
ru: почему?

source: width and height aren't tied together. Better to group them in a struct
ru: ширина и высота не связаны между собой. Лучше сгруппировать их in a struct

source: Will be 'static
ru: Будет 'static

source: Will panic! with BorrowMutError
ru: Будет паника! с BorrowMutError

source: Will print 10
ru: Напечатает 10

source: Will work
ru: Будет работать

source: With &raw const and &raw mut operators
ru: С помощью операторов &amp;raw const и &amp;raw mut

source: With any types
ru: С любыми типами

source: With associated type, trait can be implemented only once per type; with generics — multiple times
ru: С ассоциированными type, trait может быть реализовано только один раз на type; с родовыми - несколько раз

source: With compiler flag
ru: С флагом компилятора

source: With match or helper methods
ru: С помощью match или вспомогательных методов

source: With move-operation, closure can only be called once
ru: С помощью move-operation закрытие может быть вызвано только один раз

source: With special compiler flag
ru: С помощью специального флага компилятора

source: With tuples you must remember indices. Hurts readability
ru: С кортежами вы должны помнить индексы. Ухудшает читаемость

source: With what types can ranges be used in patterns?
ru: С какими типами можно использовать диапазоны in?

source: Without an intermediate layer, each format would need its own separate implementation
ru: Без промежуточного слоя каждый формат будет нуждаться в отдельной реализации

source: Without it, panic
ru: Без него паника

source: Works everywhere
ru: Работает везде

source: Works faster
ru: Работает быстрее

source: Works for types implementing Deref/DerefMut
ru: Работает for типов, реализующих Deref/DerefMut

source: Works like a struct without fields
ru: Работает как struct без полей

source: Works only for numbers
ru: Работает только с номерами for

source: Works only in a workspace
ru: Работает только in рабочее пространство

source: Works only with numbers
ru: Работает только с числами

source: Works with &String and literals - more general slice
ru: Работает с &amp;String и литералами - более общий срез

source: Works with any IntoIterator
ru: Работает с любым IntoIterator

source: Works with for
ru: Работает с for

source: Works with one type only
ru: Работает только с одним type

source: Works with ranges
ru: Работает с диапазонами

source: Would require rewriting all code generation for each format
ru: Потребуется переписать весь код генерации for каждого формата

source: Wrapping
ru: Обертывание

source: Wrapping existing type in tuple struct
ru: Обертывание существующего кортежа type in struct

source: Wrapping multiple related types into a single wrapper type
ru: Обертывание нескольких связанных типов в одну обертку type

source: Write can't be used
ru: Запись не может быть использована

source: Writes to logs
ru: Запись в журналы

source: Writing Automated Tests
ru: Написание автоматизированных тестов

source: Written as struct Name;. It's analogous to the unit ()
ru: Написано as struct Имя;. Аналогично единице ()

source: x and y are 6
ru: x и y равны 6

source: x is available
ru: x доступен

source: x is Copy
ru: x - это Copy

source: x is unavailable (moved)
ru: x недоступен (перемещен)

source: x without mut is immutable. Rust requires explicit mut; also, a ; after 5 is needed
ru: x без mut является неизменяемым. Rust требует явного mut; кроме того, необходим символ ; после 5

source: YAGNI
ru: ЯГНИ

source: Yes
ru: Да

source: Yes, all three (Fn, FnMut, FnOnce)
ru: Да, все три (Fn, FnMut, FnOnce)

source: Yes, always
ru: Да, всегда

source: Yes, and that's valid syntax
ru: Да, и это правильный синтаксис

source: Yes, any type
ru: Да, любой type

source: Yes, automatically
ru: Да, автоматически

source: Yes, but dereferencing requires unsafe
ru: Да, но для разыменования требуется unsafe

source: Yes, but it requires allocation
ru: Да, но для этого требуется распределение

source: Yes, but it's unsafe and requires great care
ru: Да, но это unsafe и требует большого ухода

source: Yes, but only for methods
ru: Да, но только for методы

source: Yes, but only for static strings
ru: Да, но только for static

source: Yes, but only for traits
ru: Да, но только for

source: Yes, but only if Copy
ru: Да, но только if Copy

source: Yes, but only in unsafe
ru: Да, но только in unsafe

source: Yes, but only once
ru: Да, но только один раз

source: Yes, but only through unsafe
ru: Да, но только через unsafe

source: Yes, by using Arc<T> instead of Rc<T>
ru: Да, используя Arc<T> вместо Rc<T>

source: Yes, cheaply and implicitly
ru: Да, дешево и неявно

source: Yes, compiler will warn if forgotten
ru: Да, компилятор выдаст предупреждение if

source: Yes, completely
ru: Да, полностью

source: Yes, due to virtual calls
ru: Да, из-за звонков на virtual

source: Yes, e.g. Box<str> or Box<[T]>
ru: Да, например. Box&lt;str&gt; или Box<[T]>

source: Yes, except for special cases
ru: Да, за исключением for особых случаев

source: Yes, for structuring relationships between parts of a program
ru: Да, for структурирование отношений между частями программы

source: Yes, full subtyping
ru: Да, полная подтипизация

source: Yes, fully
ru: Да, полностью

source: Yes, if all component types are also Send/Sync
ru: Да, if все типы компонентов также имеют функцию отправки/синхронизации

source: Yes, if From is implemented
ru: Да, if From реализована

source: Yes, if main returns Result<(), E>
ru: Да, if main возвращается Result<(), E>

source: Yes, if T: Send
ru: Да, if T: Отправить

source: Yes, if T: Sync
ru: Да, if T: Sync

source: Yes, if they are separate fields
ru: Да, if это отдельные поля

source: Yes, if you call Rc::get_mut
ru: Да, if вы вызываете Rc::get_mut

source: Yes, if you wrap data in RefCell<T> and use Rc<RefCell<T>>
ru: Да, if вы обертываете данные in RefCell<T> и use Rc&ltRefCell<T>&gt

source: Yes, it alternates polling fairly
ru: Да, опросы чередуются равномерно

source: Yes, it implements IntoIterator
ru: Да, он реализует IntoIterator

source: Yes, it's always safe
ru: Да, это всегда безопасно

source: Yes, it's common and expected
ru: Да, это обычное и ожидаемое явление

source: Yes, it's safe
ru: Да, это безопасно

source: Yes, must cover all possible values
ru: Да, необходимо охватить все возможные значения

source: Yes, no runtime overhead
ru: Да, без накладных расходов на выполнение

source: Yes, only on nightly
ru: Да, только в ночное время

source: Yes, patterns can be nested
ru: Да, детали могут быть вложенными

source: Yes, some runtimes support work stealing
ru: Да, некоторые программы поддерживают кражу работы

source: Yes, thanks to Deref
ru: Да, благодаря Дерефу

source: Yes, they are the same type
ru: Да, они одинаковые type

source: Yes, they complement each other well
ru: Да, они хорошо дополняют друг друга

source: Yes, they do nothing until await
ru: Да, они do ничего, пока await

source: Yes, they provide the same functionality
ru: Да, они обеспечивают одинаковую функциональность

source: Yes, this gives more flexibility than match
ru: Да, это обеспечивает большую гибкость, чем match

source: Yes, through mut rc
ru: Да, через mut rc

source: Yes, through RefCell<T>
ru: Да, через RefCell<T>

source: Yes, using closures
ru: Да, с помощью застежек

source: Yes, via clone() of sender
ru: Да, через clone() отправителя

source: Yes, via impl
ru: Да, через impl

source: Yes, while channel is not closed
ru: Да, канал while не закрыт

source: Yes, with explicit cast
ru: Да, с явным актерским составом

source: Yes, with lifetime annotation
ru: Да, с прижизненной аннотацией

source: Yes, with Mutex<T>
ru: Да, с Mutex<T>

source: Yes, with safe keyword
ru: Да, с безопасным ключевым словом

source: Yes, without restrictions
ru: Да, без ограничений

source: yield_now creates an await point to let the runtime run others
ru: yield_now создает точку await для let выполнения других

source: Yields to other threads
ru: Уступает другим нитям

source: You can add Option<T> to T directly
ru: Вы можете добавить Option<T> к T напрямую

source: You can combine if let, else if, and else if let for greater flexibility
ru: Вы можете комбинировать if let , else if , и else if let for более гибко

source: You can split impls. Useful for generics/traits organization
ru: Вы можете разделить импланты. Полезная организация for generics/traits

source: You can't
ru: Вы не можете

source: You can't allocate in a function
ru: Вы не можете выделить in функции

source: You can't compute string length
ru: Вы не можете вычислить длину строки

source: You can't extract data
ru: Вы не можете извлечь данные

source: You can't import two items with the same name into one scope
ru: Вы не можете импортировать два элемента с одинаковыми именами в одну область видимости

source: You can't return references
ru: Вы не можете return ссылки

source: You must import the traits for the methods to work
ru: Вы должны импортировать черты for, чтобы методы работали

source: You mustn't confuse Option<T> with T. The compiler forces explicit None handling
ru: Не следует путать Option<T> с T. Компилятор заставляет явно обрабатывать None

source: You need &mut self. It's a mutable borrow
ru: Вам нужен иmut self . Это мутабельный заем

source: You need a GC
ru: Вам нужен GC

source: You provide your own message
ru: Вы создаете свое собственное сообщение

source: You write it manually, typically returning a field
ru: Вы пишете его вручную, обычно возвращая поле

source: Your quiz progress, scores, and statistics are saved only on your device using local storage. This data is never sent to external servers or shared with third parties.
ru: Ваш прогресс в тесте, баллы и статистика сохраняются только на вашем устройстве в локальном хранилище. Эти данные никогда не передаются на внешние серверы и не передаются третьим лицам.

source: Zero levels
ru: Нулевые уровни

source: Zero-cost abstractions when used correctly
ru: Абстракции с нулевыми затратами при правильном использовании

source: Zeros the iterator
ru: Обнуляет итератор

source: zip combines elements in pairs
ru: застежка-молния сочетает в себе элементы in пар
